In [2]:
import pandas as pd  # pip install pandas

In [7]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data) # data: 리스트 or 딕셔너리 등 다양한 형태 가능
                     # pd.Series(data, index=index) 인덱스는 선택
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
index_S = ['a','b','c','d','e']

In [9]:
ser = pd.Series(data,index=index_S) 
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
ser[0],ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_12980\143202658.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0],ser['a']

(np.int64(1), np.int64(1))

In [26]:
ser.iloc[0],ser.loc['a']

(np.int64(1), np.int64(1))

In [17]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)

print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
population = pd.Series([9776, 2729, 1566, 3158],index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울','부산']])  # 펜시 인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [24]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

#판다스의 데이터프레임

In [31]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [33]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [48]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline Franklin, dtype: object

In [49]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [53]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [58]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [61]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [67]:
sci1.to_csv('./data/data_1.csv')

In [68]:
sci1.to_csv('./data/data_2.csv', index=False)

In [74]:
df = pd.read_csv('./data/data_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [73]:
df1 = pd.read_csv('scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# pickle: 파이썬의 객체형을 저장 - 파이썬 전용 포맷
sci1.to_pickle('./data/scientists.pickle')

In [79]:
df2 = pd.read_pickle('./data/scientists.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [80]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [ ]:
# 데이터 미리보기
#  info()
#  head() / tail()

In [87]:
df1.head(3) # default:5개

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [86]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.describe()  # 기본 통계 요약

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [103]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [105]:
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [90]:
df1['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [96]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [146]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [142]:
print(df.index)    # 행 이름 출력
print(df.columns)  # 열 이름 출력

RangeIndex(start=0, stop=7, step=1)
Index(['이름', '나이', '점수'], dtype='object')

In [143]:
# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [144]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [147]:
# 열 이름 변경
df.rename(columns={'이름': 'name', '나이': 'age', '점수': 'score'})
df.rename(index={"A":"a", "B": "b"})
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

# gapminder.tsv 연습

In [149]:
df_gapminder = pd.read_csv('./data/gapminder.tsv',sep='\t')
df_gapminder

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]